Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_uart5.h
#define UART5_CR2_ADD                       (0xFFU<<24)
#define UART5_CR2_ADD_0                     (0x1U<<24)
#define UART5_CR2_RTOEN                     (0x1U<<23)
#define UART5_CR2_ABRMOD                    (0x3U<<21)
#define UART5_CR2_ABRMOD_0                  (0x1U<<21)
#define UART5_CR2_ABREN                     (0x1U<<20)
#define UART5_CR2_MSBFIRST                  (0x1U<<19)
#define UART5_CR2_DATAINV                   (0x1U<<18)
#define UART5_CR2_TXINV                     (0x1U<<17)
#define UART5_CR2_RXINV                     (0x1U<<16)
#define UART5_CR2_SWAP                      (0x1U<<15)
#define UART5_CR2_LINEN                     (0x1U<<14)
#define UART5_CR2_STOP                      (0x3U<<12)
#define UART5_CR2_STOP_0                    (0x1U<<12)
#define UART5_CR2_CLKEN                     (0x1U<<11)
#define UART5_CR2_CPOL                      (0x1U<<10)
#define UART5_CR2_CPHA                      (0x1U<<9)
#define UART5_CR2_LBCL                      (0x1U<<8)
#define UART5_CR2_LBDIE                     (0x1U<<6)
#define UART5_CR2_LBDL                      (0x1U<<5)
#define UART5_CR2_ADDM7                     (0x1U<<4)
#define UART5_CR2_DIS_NSS                   (0x1U<<3)
#define UART5_CR2_SLVEN                     (0x1U<<0)
#define UART5_CR2_RTOEN_B_0X0               (0x0U<<23)
#define UART5_CR2_RTOEN_B_0X1               (0x1U<<23)
#define UART5_CR2_ABRMOD_B_0X0              (0x0U<<21)
#define UART5_CR2_ABRMOD_B_0X1              (0x1U<<21)
#define UART5_CR2_ABRMOD_B_0X2              (0x2U<<21)
#define UART5_CR2_ABRMOD_B_0X3              (0x3U<<21)
#define UART5_CR2_ABREN_B_0X0               (0x0U<<20)
#define UART5_CR2_ABREN_B_0X1               (0x1U<<20)
#define UART5_CR2_MSBFIRST_B_0X0            (0x0U<<19)
#define UART5_CR2_MSBFIRST_B_0X1            (0x1U<<19)
#define UART5_CR2_DATAINV_B_0X0             (0x0U<<18)
#define UART5_CR2_DATAINV_B_0X1             (0x1U<<18)
#define UART5_CR2_TXINV_B_0X0               (0x0U<<17)
#define UART5_CR2_TXINV_B_0X1               (0x1U<<17)
#define UART5_CR2_RXINV_B_0X0               (0x0U<<16)
#define UART5_CR2_RXINV_B_0X1               (0x1U<<16)
#define UART5_CR2_SWAP_B_0X0                (0x0U<<15)
#define UART5_CR2_SWAP_B_0X1                (0x1U<<15)
#define UART5_CR2_LINEN_B_0X0               (0x0U<<14)
#define UART5_CR2_LINEN_B_0X1               (0x1U<<14)
#define UART5_CR2_STOP_B_0X0                (0x0U<<12)
#define UART5_CR2_STOP_B_0X1                (0x1U<<12)
#define UART5_CR2_STOP_B_0X2                (0x2U<<12)
#define UART5_CR2_STOP_B_0X3                (0x3U<<12)
#define UART5_CR2_CLKEN_B_0X0               (0x0U<<11)
#define UART5_CR2_CLKEN_B_0X1               (0x1U<<11)
#define UART5_CR2_CPOL_B_0X0                (0x0U<<10)
#define UART5_CR2_CPOL_B_0X1                (0x1U<<10)
#define UART5_CR2_CPHA_B_0X0                (0x0U<<9)
#define UART5_CR2_CPHA_B_0X1                (0x1U<<9)
#define UART5_CR2_LBCL_B_0X0                (0x0U<<8)
#define UART5_CR2_LBCL_B_0X1                (0x1U<<8)
#define UART5_CR2_LBDIE_B_0X0               (0x0U<<6)
#define UART5_CR2_LBDIE_B_0X1               (0x1U<<6)
#define UART5_CR2_LBDL_B_0X0                (0x0U<<5)
#define UART5_CR2_LBDL_B_0X1                (0x1U<<5)
#define UART5_CR2_ADDM7_B_0X0               (0x0U<<4)
#define UART5_CR2_ADDM7_B_0X1               (0x1U<<4)
#define UART5_CR2_DIS_NSS_B_0X0             (0x0U<<3)
#define UART5_CR2_DIS_NSS_B_0X1             (0x1U<<3)
#define UART5_CR2_SLVEN_B_0X0               (0x0U<<0)
#define UART5_CR2_SLVEN_B_0X1               (0x1U<<0)

// CR3 Configuration

#define UART5_CR3_TXFTCFG                   (0x7U<<29)
#define UART5_CR3_TXFTCFG_0                 (0x1U<<29)
#define UART5_CR3_RXFTIE                    (0x1U<<28)
#define UART5_CR3_RXFTCFG                   (0x7U<<25)
#define UART5_CR3_RXFTCFG_0                 (0x1U<<25)
#define UART5_CR3_TCBGTIE                   (0x1U<<24)
#define UART5_CR3_TXFTIE                    (0x1U<<23)
#define UART5_CR3_WUFIE                     (0x1U<<22)
#define UART5_CR3_WUS                       (0x3U<<20)
#define UART5_CR3_WUS_0                     (0x1U<<20)
#define UART5_CR3_SCARCNT                   (0x7U<<17)
#define UART5_CR3_SCARCNT_0                 (0x1U<<17)
#define UART5_CR3_DEP                       (0x1U<<15)
#define UART5_CR3_DEM                       (0x1U<<14)
#define UART5_CR3_DDRE                      (0x1U<<13)
#define UART5_CR3_OVRDIS                    (0x1U<<12)
#define UART5_CR3_ONEBIT                    (0x1U<<11)
#define UART5_CR3_CTSIE                     (0x1U<<10)
#define UART5_CR3_CTSE                      (0x1U<<9)
#define UART5_CR3_RTSE                      (0x1U<<8)
#define UART5_CR3_DMAT                      (0x1U<<7)
#define UART5_CR3_DMAR                      (0x1U<<6)
#define UART5_CR3_SCEN                      (0x1U<<5)
#define UART5_CR3_NACK                      (0x1U<<4)
#define UART5_CR3_HDSEL                     (0x1U<<3)
#define UART5_CR3_IRLP                      (0x1U<<2)
#define UART5_CR3_IREN                      (0x1U<<1)
#define UART5_CR3_EIE                       (0x1U<<0)
#define UART5_CR3_TXFTCFG_B_0X0             (0x0U<<29)
#define UART5_CR3_TXFTCFG_B_0X1             (0x1U<<29)
#define UART5_CR3_TXFTCFG_B_0X2             (0x2U<<29)
#define UART5_CR3_TXFTCFG_B_0X3             (0x3U<<29)
#define UART5_CR3_TXFTCFG_B_0X4             (0x4U<<29)
#define UART5_CR3_TXFTCFG_B_0X5             (0x5U<<29)
#define UART5_CR3_RXFTIE_B_0X0              (0x0U<<28)
#define UART5_CR3_RXFTIE_B_0X1              (0x1U<<28)
#define UART5_CR3_RXFTCFG_B_0X0             (0x0U<<25)
#define UART5_CR3_RXFTCFG_B_0X1             (0x1U<<25)
#define UART5_CR3_RXFTCFG_B_0X2             (0x2U<<25)
#define UART5_CR3_RXFTCFG_B_0X3             (0x3U<<25)
#define UART5_CR3_RXFTCFG_B_0X4             (0x4U<<25)
#define UART5_CR3_RXFTCFG_B_0X5             (0x5U<<25)
#define UART5_CR3_TCBGTIE_B_0X0             (0x0U<<24)
#define UART5_CR3_TCBGTIE_B_0X1             (0x1U<<24)
#define UART5_CR3_TXFTIE_B_0X0              (0x0U<<23)
#define UART5_CR3_TXFTIE_B_0X1              (0x1U<<23)
#define UART5_CR3_WUFIE_B_0X0               (0x0U<<22)
#define UART5_CR3_WUFIE_B_0X1               (0x1U<<22)
#define UART5_CR3_WUS_B_0X0                 (0x0U<<20)
#define UART5_CR3_WUS_B_0X2                 (0x2U<<20)
#define UART5_CR3_WUS_B_0X3                 (0x3U<<20)
#define UART5_CR3_SCARCNT_B_0X0             (0x0U<<17)
#define UART5_CR3_DEP_B_0X0                 (0x0U<<15)
#define UART5_CR3_DEP_B_0X1                 (0x1U<<15)
#define UART5_CR3_DEM_B_0X0                 (0x0U<<14)
#define UART5_CR3_DEM_B_0X1                 (0x1U<<14)
#define UART5_CR3_DDRE_B_0X0                (0x0U<<13)
#define UART5_CR3_DDRE_B_0X1                (0x1U<<13)
#define UART5_CR3_OVRDIS_B_0X0              (0x0U<<12)
#define UART5_CR3_OVRDIS_B_0X1              (0x1U<<12)
#define UART5_CR3_ONEBIT_B_0X0              (0x0U<<11)
#define UART5_CR3_ONEBIT_B_0X1              (0x1U<<11)
#define UART5_CR3_CTSIE_B_0X0               (0x0U<<10)
#define UART5_CR3_CTSIE_B_0X1               (0x1U<<10)
#define UART5_CR3_CTSE_B_0X0                (0x0U<<9)
#define UART5_CR3_CTSE_B_0X1                (0x1U<<9)
#define UART5_CR3_RTSE_B_0X0                (0x0U<<8)
#define UART5_CR3_RTSE_B_0X1                (0x1U<<8)
#define UART5_CR3_DMAT_B_0X1                (0x1U<<7)
#define UART5_CR3_DMAT_B_0X0                (0x0U<<7)
#define UART5_CR3_DMAR_B_0X1                (0x1U<<6)
#define UART5_CR3_DMAR_B_0X0                (0x0U<<6)
#define UART5_CR3_SCEN_B_0X0                (0x0U<<5)
#define UART5_CR3_SCEN_B_0X1                (0x1U<<5)
#define UART5_CR3_NACK_B_0X0                (0x0U<<4)
#define UART5_CR3_NACK_B_0X1                (0x1U<<4)
#define UART5_CR3_HDSEL_B_0X0               (0x0U<<3)
#define UART5_CR3_HDSEL_B_0X1               (0x1U<<3)
#define UART5_CR3_IRLP_B_0X0                (0x0U<<2)
#define UART5_CR3_IRLP_B_0X1                (0x1U<<2)
#define UART5_CR3_IREN_B_0X0                (0x0U<<1)
#define UART5_CR3_IREN_B_0X1                (0x1U<<1)
#define UART5_CR3_EIE_B_0X0                 (0x0U<<0)
#define UART5_CR3_EIE_B_0X1                 (0x1U<<0)

// BRR Configuration

#define UART5_BRR_BRR                       (0xFFFFU<<0)
#define UART5_BRR_BRR_0                     (0x1U<<0)

// GTPR Configuration

#define UART5_GTPR_GT                       (0xFFU<<8)
#define UART5_GTPR_GT_0                     (0x1U<<8)
#define UART5_GTPR_PSC                      (0xFFU<<0)
#define UART5_GTPR_PSC_0                    (0x1U<<0)
#define UART5_GTPR_PSC_B_0X0                (0x0U<<0)
#define UART5_GTPR_PSC_B_0X1                (0x1U<<0)
#define UART5_GTPR_PSC_B_0X2                (0x2U<<0)
#define UART5_GTPR_PSC_B_0X3                (0x3U<<0)
#define UART5_GTPR_PSC_B_0X1F               (0x1FU<<0)
#define UART5_GTPR_PSC_B_0X20               (0x20U<<0)
#define UART5_GTPR_PSC_B_0XFF               (0xFFU<<0)

// RTOR Configuration

#define UART5_RTOR_BLEN                     (0xFFU<<24)
#define UART5_RTOR_BLEN_0                   (0x1U<<24)
#define UART5_RTOR_RTO                      (0xFFFFFFU<<0)
#define UART5_RTOR_RTO_0                    (0x1U<<0)

// RQR Configuration

#define UART5_RQR_TXFRQ                     (0x1U<<4)
#define UART5_RQR_RXFRQ                     (0x1U<<3)
#define UART5_RQR_MMRQ                      (0x1U<<2)
#define UART5_RQR_SBKRQ                     (0x1U<<1)
#define UART5_RQR_ABRRQ                     (0x1U<<0)

// ISR Configuration

#define UART5_ISR_TXFT                      (0x1U<<27)
#define UART5_ISR_RXFT                      (0x1U<<26)
#define UART5_ISR_TCBGT                     (0x1U<<25)
#define UART5_ISR_RXFF                      (0x1U<<24)
#define UART5_ISR_TXFE                      (0x1U<<23)
#define UART5_ISR_REACK                     (0x1U<<22)
#define UART5_ISR_TEACK                     (0x1U<<21)
#define UART5_ISR_WUF                       (0x1U<<20)
#define UART5_ISR_RWU                       (0x1U<<19)
#define UART5_ISR_SBKF                      (0x1U<<18)
#define UART5_ISR_CMF                       (0x1U<<17)
#define UART5_ISR_BUSY                      (0x1U<<16)
#define UART5_ISR_ABRF                      (0x1U<<15)
#define UART5_ISR_ABRE                      (0x1U<<14)
#define UART5_ISR_UDR                       (0x1U<<13)
#define UART5_ISR_EOBF                      (0x1U<<12)
#define UART5_ISR_RTOF                      (0x1U<<11)
#define UART5_ISR_CTS                       (0x1U<<10)
#define UART5_ISR_CTSIF                     (0x1U<<9)
#define UART5_ISR_LBDF                      (0x1U<<8)
#define UART5_ISR_TXFNF                     (0x1U<<7)
#define UART5_ISR_TC                        (0x1U<<6)
#define UART5_ISR_RXFNE                     (0x1U<<5)
#define UART5_ISR_IDLE                      (0x1U<<4)
#define UART5_ISR_ORE                       (0x1U<<3)
#define UART5_ISR_NE                        (0x1U<<2)
#define UART5_ISR_FE                        (0x1U<<1)
#define UART5_ISR_PE                        (0x1U<<0)
#define UART5_ISR_TXFT_B_0X0                (0x0U<<27)
#define UART5_ISR_TXFT_B_0X1                (0x1U<<27)
#define UART5_ISR_RXFT_B_0X0                (0x0U<<26)
#define UART5_ISR_RXFT_B_0X1                (0x1U<<26)
#define UART5_ISR_TCBGT_B_0X0               (0x0U<<25)
#define UART5_ISR_TCBGT_B_0X1               (0x1U<<25)
#define UART5_ISR_RXFF_B_0X0                (0x0U<<24)
#define UART5_ISR_RXFF_B_0X1                (0x1U<<24)
#define UART5_ISR_TXFE_B_0X0                (0x0U<<23)
#define UART5_ISR_TXFE_B_0X1                (0x1U<<23)
#define UART5_ISR_RWU_B_0X0                 (0x0U<<19)
#define UART5_ISR_RWU_B_0X1                 (0x1U<<19)
#define UART5_ISR_SBKF_B_0X0                (0x0U<<18)
#define UART5_ISR_SBKF_B_0X1                (0x1U<<18)
#define UART5_ISR_CMF_B_0X0                 (0x0U<<17)
#define UART5_ISR_CMF_B_0X1                 (0x1U<<17)
#define UART5_ISR_BUSY_B_0X0                (0x0U<<16)
#define UART5_ISR_BUSY_B_0X1                (0x1U<<16)
#define UART5_ISR_UDR_B_0X0                 (0x0U<<13)
#define UART5_ISR_UDR_B_0X1                 (0x1U<<13)
#define UART5_ISR_EOBF_B_0X0                (0x0U<<12)
#define UART5_ISR_EOBF_B_0X1                (0x1U<<12)
#define UART5_ISR_RTOF_B_0X0                (0x0U<<11)
#define UART5_ISR_RTOF_B_0X1                (0x1U<<11)
#define UART5_ISR_CTS_B_0X0                 (0x0U<<10)
#define UART5_ISR_CTS_B_0X1                 (0x1U<<10)
#define UART5_ISR_CTSIF_B_0X0               (0x0U<<9)
#define UART5_ISR_CTSIF_B_0X1               (0x1U<<9)
#define UART5_ISR_LBDF_B_0X0                (0x0U<<8)
#define UART5_ISR_LBDF_B_0X1                (0x1U<<8)
#define UART5_ISR_TXFNF_B_0X0               (0x0U<<7)
#define UART5_ISR_TXFNF_B_0X1               (0x1U<<7)
#define UART5_ISR_TC_B_0X0                  (0x0U<<6)
#define UART5_ISR_TC_B_0X1                  (0x1U<<6)
#define UART5_ISR_RXFNE_B_0X0               (0x0U<<5)
#define UART5_ISR_RXFNE_B_0X1               (0x1U<<5)
#define UART5_ISR_IDLE_B_0X0                (0x0U<<4)
#define UART5_ISR_IDLE_B_0X1                (0x1U<<4)
#define UART5_ISR_ORE_B_0X0                 (0x0U<<3)
#define UART5_ISR_ORE_B_0X1                 (0x1U<<3)
#define UART5_ISR_NE_B_0X0                  (0x0U<<2)
#define UART5_ISR_NE_B_0X1                  (0x1U<<2)
#define UART5_ISR_FE_B_0X0                  (0x0U<<1)
#define UART5_ISR_FE_B_0X1                  (0x1U<<1)
#define UART5_ISR_PE_B_0X0                  (0x0U<<0)
#define UART5_ISR_PE_B_0X1                  (0x1U<<0)

// ISR_ALTERNATE Configuration

