Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_uart5.h
#define UART5_ISR_ALTERNATE_TCBGT           (0x1U<<25)
#define UART5_ISR_ALTERNATE_REACK           (0x1U<<22)
#define UART5_ISR_ALTERNATE_TEACK           (0x1U<<21)
#define UART5_ISR_ALTERNATE_WUF             (0x1U<<20)
#define UART5_ISR_ALTERNATE_RWU             (0x1U<<19)
#define UART5_ISR_ALTERNATE_SBKF            (0x1U<<18)
#define UART5_ISR_ALTERNATE_CMF             (0x1U<<17)
#define UART5_ISR_ALTERNATE_BUSY            (0x1U<<16)
#define UART5_ISR_ALTERNATE_ABRF            (0x1U<<15)
#define UART5_ISR_ALTERNATE_ABRE            (0x1U<<14)
#define UART5_ISR_ALTERNATE_UDR             (0x1U<<13)
#define UART5_ISR_ALTERNATE_EOBF            (0x1U<<12)
#define UART5_ISR_ALTERNATE_RTOF            (0x1U<<11)
#define UART5_ISR_ALTERNATE_CTS             (0x1U<<10)
#define UART5_ISR_ALTERNATE_CTSIF           (0x1U<<9)
#define UART5_ISR_ALTERNATE_LBDF            (0x1U<<8)
#define UART5_ISR_ALTERNATE_TXE             (0x1U<<7)
#define UART5_ISR_ALTERNATE_TC              (0x1U<<6)
#define UART5_ISR_ALTERNATE_RXNE            (0x1U<<5)
#define UART5_ISR_ALTERNATE_IDLE            (0x1U<<4)
#define UART5_ISR_ALTERNATE_ORE             (0x1U<<3)
#define UART5_ISR_ALTERNATE_NE              (0x1U<<2)
#define UART5_ISR_ALTERNATE_FE              (0x1U<<1)
#define UART5_ISR_ALTERNATE_PE              (0x1U<<0)
#define UART5_ISR_ALTERNATE_TCBGT_B_0X0     (0x0U<<25)
#define UART5_ISR_ALTERNATE_TCBGT_B_0X1     (0x1U<<25)
#define UART5_ISR_ALTERNATE_RWU_B_0X0       (0x0U<<19)
#define UART5_ISR_ALTERNATE_RWU_B_0X1       (0x1U<<19)
#define UART5_ISR_ALTERNATE_SBKF_B_0X0      (0x0U<<18)
#define UART5_ISR_ALTERNATE_SBKF_B_0X1      (0x1U<<18)
#define UART5_ISR_ALTERNATE_CMF_B_0X0       (0x0U<<17)
#define UART5_ISR_ALTERNATE_CMF_B_0X1       (0x1U<<17)
#define UART5_ISR_ALTERNATE_BUSY_B_0X0      (0x0U<<16)
#define UART5_ISR_ALTERNATE_BUSY_B_0X1      (0x1U<<16)
#define UART5_ISR_ALTERNATE_UDR_B_0X0       (0x0U<<13)
#define UART5_ISR_ALTERNATE_UDR_B_0X1       (0x1U<<13)
#define UART5_ISR_ALTERNATE_EOBF_B_0X0      (0x0U<<12)
#define UART5_ISR_ALTERNATE_EOBF_B_0X1      (0x1U<<12)
#define UART5_ISR_ALTERNATE_RTOF_B_0X0      (0x0U<<11)
#define UART5_ISR_ALTERNATE_RTOF_B_0X1      (0x1U<<11)
#define UART5_ISR_ALTERNATE_CTS_B_0X0       (0x0U<<10)
#define UART5_ISR_ALTERNATE_CTS_B_0X1       (0x1U<<10)
#define UART5_ISR_ALTERNATE_CTSIF_B_0X0     (0x0U<<9)
#define UART5_ISR_ALTERNATE_CTSIF_B_0X1     (0x1U<<9)
#define UART5_ISR_ALTERNATE_LBDF_B_0X0      (0x0U<<8)
#define UART5_ISR_ALTERNATE_LBDF_B_0X1      (0x1U<<8)
#define UART5_ISR_ALTERNATE_TXE_B_0X0       (0x0U<<7)
#define UART5_ISR_ALTERNATE_TXE_B_0X1       (0x1U<<7)
#define UART5_ISR_ALTERNATE_TC_B_0X0        (0x0U<<6)
#define UART5_ISR_ALTERNATE_TC_B_0X1        (0x1U<<6)
#define UART5_ISR_ALTERNATE_RXNE_B_0X0      (0x0U<<5)
#define UART5_ISR_ALTERNATE_RXNE_B_0X1      (0x1U<<5)
#define UART5_ISR_ALTERNATE_IDLE_B_0X0      (0x0U<<4)
#define UART5_ISR_ALTERNATE_IDLE_B_0X1      (0x1U<<4)
#define UART5_ISR_ALTERNATE_ORE_B_0X0       (0x0U<<3)
#define UART5_ISR_ALTERNATE_ORE_B_0X1       (0x1U<<3)
#define UART5_ISR_ALTERNATE_NE_B_0X0        (0x0U<<2)
#define UART5_ISR_ALTERNATE_NE_B_0X1        (0x1U<<2)
#define UART5_ISR_ALTERNATE_FE_B_0X0        (0x0U<<1)
#define UART5_ISR_ALTERNATE_FE_B_0X1        (0x1U<<1)
#define UART5_ISR_ALTERNATE_PE_B_0X0        (0x0U<<0)
#define UART5_ISR_ALTERNATE_PE_B_0X1        (0x1U<<0)

// ICR Configuration

#define UART5_ICR_WUCF                      (0x1U<<20)
#define UART5_ICR_CMCF                      (0x1U<<17)
#define UART5_ICR_UDRCF                     (0x1U<<13)
#define UART5_ICR_EOBCF                     (0x1U<<12)
#define UART5_ICR_RTOCF                     (0x1U<<11)
#define UART5_ICR_CTSCF                     (0x1U<<9)
#define UART5_ICR_LBDCF                     (0x1U<<8)
#define UART5_ICR_TCBGTCF                   (0x1U<<7)
#define UART5_ICR_TCCF                      (0x1U<<6)
#define UART5_ICR_TXFECF                    (0x1U<<5)
#define UART5_ICR_IDLECF                    (0x1U<<4)
#define UART5_ICR_ORECF                     (0x1U<<3)
#define UART5_ICR_NECF                      (0x1U<<2)
#define UART5_ICR_FECF                      (0x1U<<1)
#define UART5_ICR_PECF                      (0x1U<<0)

// RDR Configuration

#define UART5_RDR_RDR                       (0x1FFU<<0)
#define UART5_RDR_RDR_0                     (0x1U<<0)

// TDR Configuration

#define UART5_TDR_TDR                       (0x1FFU<<0)
#define UART5_TDR_TDR_0                     (0x1U<<0)

// PRESC Configuration

#define UART5_PRESC_PRESCALER               (0xFU<<0)
#define UART5_PRESC_PRESCALER_0             (0x1U<<0)
#define UART5_PRESC_PRESCALER_B_0X0         (0x0U<<0)
#define UART5_PRESC_PRESCALER_B_0X1         (0x1U<<0)
#define UART5_PRESC_PRESCALER_B_0X2         (0x2U<<0)
#define UART5_PRESC_PRESCALER_B_0X3         (0x3U<<0)
#define UART5_PRESC_PRESCALER_B_0X4         (0x4U<<0)
#define UART5_PRESC_PRESCALER_B_0X5         (0x5U<<0)
#define UART5_PRESC_PRESCALER_B_0X6         (0x6U<<0)
#define UART5_PRESC_PRESCALER_B_0X7         (0x7U<<0)
#define UART5_PRESC_PRESCALER_B_0X8         (0x8U<<0)
#define UART5_PRESC_PRESCALER_B_0X9         (0x9U<<0)
#define UART5_PRESC_PRESCALER_B_0XA         (0xAU<<0)
#define UART5_PRESC_PRESCALER_B_0XB         (0xBU<<0)
